{
  "practices": [
    {
      "id": 1759428358628,
      "notes": "First ever practice wrestling. Was a beginner type class for fundamentals. I was able to grasp some basics alright but hesitant to have direct conflict and press up aggressively on opponent. Afraid of injuring self and others. Most guys weren't too much of a challenge in beginner level. One I had to actually take it easy on. But one guy threw my off easily and quickly. Knew the moves better and could exhaust me. After grappling with him I was the most gassed I have ever been in my life. My head was pounding and my heart was thumping like a double kick drum. I thought I was either going to pass out or throw up. It was incredible how everything else melts away in the heat of such moments. Even right after I recall nothing but concern for breathing and recovery. Pure focus. One hell of a shock to the system. The day after everything was sore. Every muscle, every fibre. Brutal but a thrilling new journey began.",
      "duration": 60,
      "type": "mixed",
      "intensity": 9,
      "physical": 9,
      "mental": 6,
      "date": "2025-09-09",
      "practiceNumber": 1,
      "storyGeneratedDate": "2025-10-02T18:06:48.583Z"
    },
    {
      "id": 1759428673963,
      "notes": "Got an ankle pick. But gruelling physically. Even early into the workout in practice my legs were exhausted and I was gased.\n\nSecond practice with the wrestling shoes. Make a great difference. Technique came in for a moment or two in some takedowns during the double leg and high crotch. Still afraid to tuck my head in for the single leg. Afraid of neck injuries and getting tossed around.\n\nLearning opponent styles. Some hand fight a lot. Others always look for the single leg and shoot hard and fast, less upper body Greco Roman Focus. Others move strangely with too much thoughts allowing me to find openings because they try to figure me out too much.",
      "duration": 90,
      "type": "mixed",
      "intensity": 9,
      "physical": 9,
      "mental": 7,
      "date": "2025-09-26",
      "practiceNumber": 2,
      "storyGeneratedDate": "2025-10-02T18:12:23.509Z"
    },
    {
      "id": 1760135768820,
      "notes": "~Lost the data for this practice~",
      "duration": 90,
      "type": "mixed",
      "intensity": 7,
      "physical": 8,
      "mental": 7,
      "date": "2025-10-03",
      "practiceNumber": 3,
      "storyGeneratedDate": null
    },
    {
      "id": 1760145952841,
      "notes": "Today was really different for the wrestling. I mean I was. I felt a lot fitter. It was quicker. Maybe the technique is starting to get there for some of the shots. I'm starting to know what I'm doing next. I'm able to shoot for some takedowns some single leg double legs and then know what to do. The one thing that's still there is the lack of confidence for the follow through so I can get to some of the single leg double leg high crotch shots but it's not really finishing because I'll get in there but like by momentum slows I stop it. Which basically means I'm thinking about. I need to get to that lagging to get to that leg. Not thinking what I need to get behind him and that's what coach is pushing for us to to learn right is say you're not trying to get to where he's at. You're trying to get to work. What's behind him you have to where he's going to be right so I'm getting into the double leg but then I get to the point where the guy can just sprawl on me a lot easier because I'm just trying to get to where his legs are but I get to where his legs are and he moves back of course. So I got to work on getting to the legs contacting him and going through that contact and not like worrying about hitting it and like hurting him hurting myself. You know that means I need to practice that move. So when I get to the live wrestling sessions, I'm not slow. I'm not afraid to make and commit to the takedowns. Otherwise oh my God cardio way better like miles my opponent. My partner was gasping for air. At some moments I wasn't. There were moments where I was always breathing harder but I got back so quick so I definitely feel now the cardio come back up now which is really nice to see. Or maybe my opponent just wasn't as good about making me carry my weight and I'm getting way better at using that. You know those the levels right the hand fighting game to keep them engaged, taking some shots then pulling late down so but he's worried about the the shots I'm taking are going to take. He's not thinking about all the weight I'm putting on him.",
      "duration": 90,
      "type": "mixed",
      "intensity": 6,
      "physical": 7,
      "mental": 6,
      "date": "2025-10-11",
      "practiceNumber": 4,
      "storyGeneratedDate": "2025-10-11T01:28:29.661Z"
    },
    {
      "id": 1763432511618,
      "notes": "It's been about a month since I've been back to wrestling so it was intense to say the least. I really expected it to kick my ass but it was a lot better than I realized it would be. I was glad that I didn't have stop early or anything I could keep going through most of it and even some of the other guys would stop before I did. Or you was built up to a solid baseline already and didn't drop too aggressively. I was good enough. Well off for the month to keep up some cardio right? I was off because of a skin infection and traveling to Mexico. But now that I'm back at is it feels awesome to be back doing the drills practicing things again. It's more or less stayed with me working on chaining stuff at her arm and hand fighting. I need Tyler leverage and the clinches got to get in tight. Got to eat and clothes. My legs are still behind me too far up and she can't right under the guy for my takedowns.",
      "duration": 120,
      "type": "mixed",
      "intensity": 9,
      "physical": 8,
      "mental": 9,
      "date": "2025-11-18",
      "practiceNumber": 5,
      "storyGeneratedDate": "2025-11-18T03:18:51.259Z"
    },
    {
      "id": 1763778269805,
      "notes": "Today was very different besides the fact that mentally I did not feel anywhere near a strain is when I first started when I first started it was at 9:00. Like every practice. I have no idea what I'm doing. Nothing really makes sense. I'm worried about hurting myself hurting my opponent. You know landing on my wrist twisting my knee just no comfort anywhere. Way too far away. No idea how to move my legs. How to move them to my knees move around on the ground but now I'm really getting through it. The last practice I made at my first headstand flip type thing today I managed to do it the whole way across the gym the whole way so something really clicked there and I'm starting to get the fuel for how to be a spring there. It's just generally getting a lot more comfortable down on the ground inverted moving around there when I was clinching not clinching. When I was wrestling with the guys I was moving more fluidly if I was turning the corner better getting stronger logs. I was with some guys that were not as big as me or as tall as me. I should say and definitely not as athletic but my way cost. They were all around my weight or very close to maybe a few pounds. Less, but I think those long levers do help those long arms and I'm athletic. I think it's helping me a lot but I'm picking it up really quick as well. Moving things around remembering how to do stuff. I was doing a drill where we're trying to get to a single leg or double leg takedown with one guy who had really good hand fighting. He was an arm wrestler so she was really strong. Great grip and always getting nowhere with my strategy of pushing straight on and trying to overpower him because he was really strong and totally ready for that. So I switched up on him and pushed up top like I was going to go for the power move and I broke free. Went down low and got an ankle pick on it which was really nice. I was really happy about that. This is just using different tactics using different approaches. Not shutting down and trying one. Getting frustrated and getting nowhere. You know being versatile is important. It's another guy. I was getting the usual single leg double leg. Some were good. Some were not so good. My single leg is okay but I have to use Judo like I have to use my my right leg or left leg to sweep the other leg or plant. So I twist them around my legs when he falls. I feel like I'm not getting the right mechanics so I need to work on that. And the high cross takedown is also not good. I'm picking up the leg and pushing into him but he's just kind of hopping on the one leg so I'm like just hopping around the gym. I'm not taking them down. I'm wondering if I have to push more because it could be the case that I'm pushing him forward. He's able to jump so you know what I should try is doing the push forward where he jumps the one leg, but then I push right after I pushed the first time with more so he's coming to land but I'm already pushing his body always up in the air. That could be another way as well at the same time. I think the coach showed me many weeks ago how to do these? The high crotch really well where he picked the leg up and he kind of just twisted around and I I fell over it so I need to work on the mechanics. Another highlight besides the ankle pink was this moment where I was doing a drill and he I had to move his head. The Defenders the attackers had so right to the center of my body when it's on the side on the side he can do high crotch or go for double like. But in the center he has only the single leg and it's a lot easier to defend in China sprawl out so I moved his head really well. I'll get him to the sprawl position but I kind of got put onto my my bud and I'm sitting down with him right there and I grab around his body try and hold him from going around to my back to score and I remember a move I did previously and I saw and I said forward and I grabbed him tight walk then sibling back on roll back and toss them over and roll over it. So just another move. Another Escape another approach that's the drill but also more than the drill so alcohol more live.",
      "duration": 120,
      "type": "mixed",
      "intensity": 8,
      "physical": 8,
      "mental": 6,
      "date": "2025-11-22",
      "practiceNumber": 6,
      "storyGeneratedDate": "2025-11-22T02:25:20.648Z"
    },
    {
      "id": 1764389970936,
      "notes": "Today's practice was significantly different for my understanding way. I used my hooks leverage and weight was a lot more fluent, more fluid. We had a really nice drill towards the beginning. After I warm up we did 30 minutes straight continuous wrestling bitte Couch Cornet water wrestling where you're just always in contact with your partner. Always wrestling only about 65% of your max or so. I went with a guy named Marcus and he was okay. He didn't really get the whole leverage weight and hooks kind of thing. The lever stills bodily pieces didn't click for him yet so I was throwing him around like a ragdoll most the practice and was able to flip in maneuver practice things that I seen a couple times. For example, there's one move I want to try so I let myself get caught in a body lock from him when I shot in for a leg for a takedown. If I didn't make the takedown and let him get the body lock so I could practice a sit out which worked really really well. Mostly because he wasn't really anticipating it. But also because I was learning the way to move around him get underneath, get the under hooks, make him carry my weight and find positions where it was really easy to move him. I could use brute Force in some positions and just slip them over roll but it was great as I was going through to feel that motion of knowing when I needed to move to different position and feeling the leverage. That was a big piece. Minimal if any throws right a couple takedowns. We're just kind of flowing through the different positions, but I was getting a very good sense for that. She enjoyed it physically. I always Poison and we're getting tiring towards the end but I was nowhere near as Cass. I as had been previously only at the very end. The finisher had took a lot out of me but while I was in practice! I didn't feel like I was gasping for Bethel one time or absolutely exhausted. The way I was early on body is really adapting. It's really learning too. Basically a mentally so very good practice. I feel a lot more skilled now",
      "duration": 120,
      "type": "mixed",
      "intensity": 8,
      "physical": 7,
      "mental": 6,
      "date": "2025-11-29",
      "practiceNumber": 7,
      "storyGeneratedDate": "2025-11-29T04:21:08.925Z"
    },
    {
      "id": 1764643408701,
      "notes": "Today was a very different day of practice. The warm-up was intense as usual. Pretty tiring working hard. There was moments where I was pushed to my limit or are very close to because the warrant was a group activity right? So we yell over stuff together more of the competition wrestlers and the Casual first timers which is me. So that's why I was at that higher level of intensity. You broke off into groups and today we did a lot of ground work partere four-point position which is important. I wanted to do more of the live wrestling stuff just to flow with it but kind of seemed to feel like I should be in the other spot. Honest. I just went there myself. I'm glad I did. I got a ton of technical experience more one-on-one time with the coach so to me makes a ton more sense. I need all that time I can get. I don't just need the the Reps for flowing so gerade dann Baby teach me a little bit when else sun flaws or they really weren't a challenge like it was really slow. The pace was super slow. I wasn't tired at all. I felt I could do so much more during that part towards the end we did some live stuff and some of the guys I wrestled it was like child's Play was nothing for me and then I got to wrestle two other guys. I'm pretty sure too Iranian dudes two Persians and I have no idea how long them wrestling for. I think I made the mistake of thinking that everybody is at my level or maybe I just didn't fully realize how much time and effort other people I put into wrestling already and my ego takes a hit when I'm getting my ass kicked by them at the same time. I really liked it cuz I appreciate how much I learned one guy. I swear he couldn't have been more than 110 lb and that's soaking wet small. Putting me at his technique was so good he was putting me on my bud. Flip me around pretty comfortably like it was hard for him. I could tell you straining up but he had the leverage points. You knew how to use it. So pretty rough other guy he was talking or he was heavier. He could have been him closer on my way but he was shorter for sure. So stocky but he had a lot of intensity and what slipped me around twisting me wrenching on my head which I really don't like on my jaw. But it is a good wrestling technique. He was just moving me around. It was really hard. It was really gritty. He didn't really take it too easy and I'm not sure if that's him being intense or part of me feeling a bit bullied. I don't feel like he's totally a bully but he's smothering me right? Like I was getting having to tap out it was okay right? When you think about it it's okay. I think he's showing me more respect by going intense. You know he's not like all those guys a waste of time. God only knows maybe he would abuse a beginner like just rip him around the gym and screw him up. And I'd like to think that he was showing Respect by wrestling hard with me and what not. But I don't even think I got a chance to do anything to take him downward or not. What not I might have got to the back once in like a minute or so. So I fully defeated after him. In particular cuz you just smothered me. I was out of control completely. My head was the wrong place. Let's get pulled and twisted and felt like an idiot. That's how it goes with only a few practices right? And other people who I've been practicing for a long time and know where the movements. No word to being where not to be how to get the leverage and get locked in the head. I could feel him grabbing for holds. They were getting under hooks really well. I was forgetting those placements. I really couldn't do anything with him and that was quite the learning experience and humbling.",
      "duration": 120,
      "type": "mixed",
      "intensity": 7,
      "physical": 6,
      "mental": 6,
      "date": "2025-12-02",
      "practiceNumber": 8,
      "storyGeneratedDate": "2025-12-02T04:00:02.191Z"
    }
  ],
  "profile": {
    "key": "user",
    "earnedBadges": [
      {
        "id": "first_practice",
        "earnedDate": "2025-10-02",
        "practiceNumber": 1,
        "category": "volume"
      },
      {
        "id": "three_practices",
        "earnedDate": "2025-10-10",
        "practiceNumber": 3,
        "category": "volume"
      },
      {
        "id": "five_practices",
        "earnedDate": "2025-11-18",
        "practiceNumber": 5,
        "category": "volume"
      },
      {
        "id": "high_intensity_focus",
        "earnedDate": "2025-11-18",
        "practiceNumber": 5,
        "category": "consistency"
      },
      {
        "id": "hours_ten",
        "earnedDate": "2025-11-29",
        "practiceNumber": 7,
        "category": "hours"
      }
    ],
    "earnedMilestones": [
      {
        "id": "first_practice",
        "name": "Day One",
        "earnedDate": "2025-10-02",
        "practiceNumber": 1,
        "level": "amateur",
        "description": "Your first practice logged."
      },
      {
        "id": "first_week",
        "name": "First Week",
        "earnedDate": "2025-11-18",
        "practiceNumber": 5,
        "level": "amateur",
        "description": "Five practices in your first week."
      },
      {
        "id": "ten_hours",
        "name": "Ten Hours",
        "earnedDate": "2025-11-29",
        "practiceNumber": 7,
        "level": "amateur",
        "description": "More than ten hours of mat time recorded."
      }
    ],
    "currentPhase": 1,
    "streaks": {
      "days": 0,
      "weeks": 0
    },
    "backupSettings": {
      "enabled": true,
      "lastManualDownload": "2025-11-29T04:21:16.804Z"
    }
  },
  "exportDate": "2025-12-02T04:00:10.591Z",
  "backup": {
    "generatedAt": "2025-12-02T04:00:10.591Z",
    "reason": "manual-download",
    "version": 2,
    "totalPractices": 8,
    "includedPractices": 8,
    "appVersion": "1.3.0"
  }
}